TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/asp/bootloader/drvqflx.c
// Reset
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_RST = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x99,
};

// Write Enable
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_WREN = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x06,
};

// Write Status Register
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_WRSR = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_SINGLE_LINE,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x01,
};

// Global Block-Protection Unlock
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_ULBPR = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x98,
};

// Sector Erase
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_SE = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_SINGLE_LINE,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x20,
};

// Chip Erase
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_CE = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_NO_DATA,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_8BIT,
    .admode = ADMODE_NO_ADDRESS,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0xc7,
};

// SPI Quad IO Read
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_SQOR = {
    .fmode = FMODE_INDIRECT_READ,
    .dmode = DMODE_FOUR_LINES,
    .dcyc = 8,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_SINGLE_LINE,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x6b,
};

// SPI Quad Page Program
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_QPP = {
    .fmode = FMODE_INDIRECT_WRITE,
    .dmode = DMODE_FOUR_LINES,
    .dcyc = 0,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_FOUR_LINES,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x32,
};

// SPI Memmap
static const QSPI_TRANSFER_CONFIG_T FLASH_CMD_MAP = {
    .fmode = FMODE_MEMORY_MAPPED,
    .dmode = DMODE_FOUR_LINES,
    .dcyc = 8,
    .absize = ABSIZE_8BIT,
    .abmode = ABMODE_NO_ALTERNATE_BYTES,
    .adsize = ADSIZE_24BIT,
    .admode = ADMODE_SINGLE_LINE,
    .imode = IMODE_SINGLE_LINE,
    .instruction = 0x6b,
};

// メッセージ番号
enum {
  MSG_NONE = 0,
  MSG_INITIALIZE,
  MSG_READ,
  MSG_WRITE,
  MSG_ERASE,
  MSG_START_MEMMAP,
  MSG_END_MEMMAP,
};

// データキュータイムアウト
static const int32_t DTQTIMEOUT = 1000;

// イベントフラグ
static const FLGPTN FLGPTN_DMA_COMPLETE = 			(0x1 << 0);
static const FLGPTN FLGPTN_QSPI_TRANSFER_COMPLETE = (0x1 << 1);
static const FLGPTN FLGPTN_QSPI_STATUS_MATCH = 		(0x1 << 2);

/*
 * 内部変数
 */
//static uint8_t s_testbuf[1024*4];// 4k

/*********************************************************************
 * 公開関数
 ********************************************************************/

/*
 * ペリフェラル初期化
 */
void drvqflx_initialize_peripherals()
{
    DBGLOG0("drvqflx_initialize_peripherals");

    // GPIOピン設定
    for (int i = 0; i < sizeof(GPIO_PINS_QSPI) / sizeof(GPIO_PINS_QSPI[0]); i++) {
        drvcmn_gpio_pin_initialize(&(GPIO_PINS_QSPI[i].pin), GPIO_PINS_QSPI[i].setting);
    }

    // DMA初期化
    //drvcmn_dma_initialize(&DMA_STREAM, &DMA_SETTING);

    // QUADSPI初期化
    qspi_initialize();

}

/*
 * ドライバ初期化
 */
void drvqflx_initialize()
{
    DBGLOG0("drvqflx_initialize");

    qspi_flash_configure();
}

/*
 * 読み込み
 */
void drvqflx_read(void* dest, intptr_t src, size_t length)
{
//    DBGLOG0("drvqflx_read");

    qspi_flash_read((void*)dest, src, length);
}

/*
 * メモリマップ開始
 */
void drvqflx_start_memmap(DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvqflx_memmap");

}

/*
 * メモリマップ終了
 */
void drvqflx_end_memmap(DRVFLX_CALLBACK_T callback)
{
    DBGLOG0("drvqflx_end_memmap");

}

/*
 * 書き込み
 */
void drvqflx_write(intptr_t dest, const void* src, size_t length)
{
    DBGLOG0("drvqflx_write");

    qspi_flash_write((void*)src, dest, length);
}

/*
 * 消去
 */
void drvqflx_erase(intptr_t addr, size_t length)
{
    DBGLOG0("drvqflx_erase");

    qspi_flash_erase(addr, length);
}

void drvqflx_qspi_isr(intptr_t exinf)
{
    //DBGLOG0("drvqflx_qspi_isr");

    ER er = E_OK;

    if (drvcmn_getreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 19, 0x1) &&	// [19]SMIE
        drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 3, 0x1)) {	// [3]SMF
        // ステータスマッチ
        // フラグクリア
        drvcmn_setreg32(QSPI_R_BASE + 0xC /* QUADSPI_FCR */, 3, 0x1, 0x1);
        // 割込み無効
        drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 19, 0x1, 0);
        // 通知
        er = iset_flg(FLG_DRVFLX, FLGPTN_QSPI_STATUS_MATCH);
        assert(er == E_OK);
    } else if (drvcmn_getreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 17, 0x1) &&	// [17]TCIE
               drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 1, 0x1)) {	// [1]TCF
        // 転送完了
        // フラグクリア
        drvcmn_setreg32(QSPI_R_BASE + 0xC /* QUADSPI_FCR */, 1, 0x1, 0x1);
        // 割込み無効
        drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 17, 0x1, 0);
        // 通知
        er = iset_flg(FLG_DRVFLX, FLGPTN_QSPI_TRANSFER_COMPLETE);
        assert(er == E_OK);
    } else if (drvcmn_getreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 16, 0x1) &&	// [16]TEIE
               drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 0, 0x1)) {	// [0]TEF
        // 転送エラー(アドレス不正)
        // フラグクリア
        drvcmn_setreg32(QSPI_R_BASE + 0xC /* QUADSPI_FCR */, 0, 0x1, 0x0);	// [0]CTEF
        // 割込み無効
        drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 16, 0x1, 0);	// [16]TEIE
        // 通知
        er = iset_flg(FLG_DRVFLX, FLGPTN_QSPI_TRANSFER_COMPLETE);
        assert(er == E_OK);
    } else {
        DBGLOG1("sr: 0x%08x", drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 0, ~(uint32_t)0));
        assert(false);
    }

