TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/asp/bootloader/drvqflx.c
}

/*********************************************************************
 * 内部関数
 ********************************************************************/

/*
 * QSPI初期化
 */
void qspi_initialize()
{
    // QSPIクロック有効
    drvcmn_setreg32(TADR_RCC_BASE + TOFF_RCC_AHB3ENR, 0, RCC_AHB3ENR_QSPIEN, ~(uint32_t)0);

    // QUADSPI_CR
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 24, 0xff, 2);	// PRESCALER => 2
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 22, 0x1, 0);	// APMS => 1
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 8, 0x1f, 0);	// FTHRES => 0
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 4, 0x1, 0);		// SSHIFT => 0

    // QUADSPI_DCR
    drvcmn_setreg32(QSPI_R_BASE + 0x4 /* QUADSPI_DCR */, 16, 0x1f, 20);	// FSIZE => 20 (2 ^ (20 + 1) = 2MB)
    drvcmn_setreg32(QSPI_R_BASE + 0x4 /* QUADSPI_DCR */, 8, 0x7, 7);	// CSHT => 1

    // LPTR
    drvcmn_setreg32(QSPI_R_BASE + 0x30 /* QUADSPI_LPTR */, 0, 0xFF, 0xFF);

    // QUADSPI有効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, 0x1, 1);		// EN => 1
}

/*
 * メモリプールを使ったメッセージ送信
 */
void mpf_send(int msg, intptr_t src, intptr_t dest, size_t size, DRVFLX_CALLBACK_T callback)
{
    DRVFLX_MPFBLK_T* blk = NULL;
    ER er = 0;
    er = tget_mpf(MPF_DRVFLX, (void**)&blk, DTQTIMEOUT);
    assert(er == E_OK);

    blk->msg = msg;
    blk->src = src;
    blk->dest = dest;
    blk->size = size;
    blk->callback = callback;
    er = tsnd_dtq(DTQ_DRVFLX, (intptr_t)blk, DTQTIMEOUT);
    assert(er == E_OK);
}

/*
 * SPIフラッシュ設定
 */
void qspi_flash_configure()
{
    DBGLOG0("qspi_flash_configure");

    // BUSYクリア待ち
   qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

   // リセットコマンド
   qspi_transfer(&FLASH_CMD_RSTEN, NULL);
   qspi_transfer(&FLASH_CMD_RST, NULL);
   qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

   // Configuration Register の [1]IOC ビットをセット
   qspi_transfer(&FLASH_CMD_WREN, NULL);   // Write Enable
   qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY | FLASH_STATUS_MASK_WEL, FLASH_STATUS_MASK_WEL);
   qspi_transfer(&FLASH_CMD_WRSR,
                 &(QSPI_TRANSFER_DATA_T){.mcuaddr = (uint8_t[]){0x00, 0x02}, .length = 2});
   qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

   // 書込み保護を全て解除(Global Block-Protection Unlock)
   qspi_transfer(&FLASH_CMD_WREN, NULL);   // Write Enable
   qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY | FLASH_STATUS_MASK_WEL, FLASH_STATUS_MASK_WEL);
   qspi_transfer(&FLASH_CMD_ULBPR, NULL);
   qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);
}

/*
 * SPIフラッシュ読込み
 */
int qspi_flash_read(void* dest, intptr_t flash_addr, size_t length)
{
    assert(dest);
    assert(length > 0);

    // 読込み
    qspi_transfer(&FLASH_CMD_SQOR,
                  &(QSPI_TRANSFER_DATA_T){.ar = flash_addr, .mcuaddr = dest, .length = length});
    qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

    return 0;
}

/*
 * SPIフラッシュ書込み
 */
int qspi_flash_write(const void* src, intptr_t flash_addr, size_t length)
{
    assert(src);
    assert(length > 0);
    assert(flash_addr + length <= FLASH_SIZE);

    static uint8_t s_pagebuf[FLASH_PAGE_SIZE];

    const void* cur_mem = src;
    intptr_t cur_flash = flash_addr;
    size_t length_written = 0;

    const void* transfer_src = NULL;
    uint32_t ar = 0;
    size_t transfer_length = 0;

    // 開始アドレスがページの先頭から離れている場合, 0xffを付加してページ先頭から書き込む
    size_t skip = flash_addr % FLASH_PAGE_SIZE;
    if (skip != 0) {
        transfer_src = s_pagebuf;
        ar = cur_flash - skip;
        transfer_length = (length + skip > FLASH_PAGE_SIZE ? FLASH_PAGE_SIZE : length + skip);

        // 一時バッファにデータコピー
        memset(s_pagebuf, 0xff, skip);
        memcpy(s_pagebuf + skip, src, transfer_length - skip);

        // 書込み実行
        qspi_transfer(&FLASH_CMD_WREN, NULL);	// Write Enable
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY | FLASH_STATUS_MASK_WEL, FLASH_STATUS_MASK_WEL);
        qspi_transfer(&FLASH_CMD_QPP,
                      &(QSPI_TRANSFER_DATA_T){.ar = ar, .mcuaddr = (void*)transfer_src, .length = transfer_length});
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

        length_written += transfer_length - skip;
        cur_mem += transfer_length - skip;
        cur_flash += transfer_length - skip;
    }

    while (length_written < length) {
        transfer_src = cur_mem;
        ar = cur_flash;
        transfer_length = (length - length_written > FLASH_PAGE_SIZE ? FLASH_PAGE_SIZE : length - length_written);

        // 書込み実行
        qspi_transfer(&FLASH_CMD_WREN, NULL);	// Write Enable
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY | FLASH_STATUS_MASK_WEL, FLASH_STATUS_MASK_WEL);
        qspi_transfer(&FLASH_CMD_QPP,
                      &(QSPI_TRANSFER_DATA_T){.ar = ar, .mcuaddr = (void*)transfer_src, .length = transfer_length});
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

        length_written += transfer_length;
        cur_mem += transfer_length;
        cur_flash += transfer_length;
    }

    assert(length_written == length);

    return 0;
}

/*
 * SPIフラッシュ消去
 */
int qspi_flash_erase(intptr_t flash_addr, size_t length)
{
    assert(flash_addr % FLASH_SECTOR_SIZE == 0);
    assert(length > 0 && length % FLASH_SECTOR_SIZE == 0);

    intptr_t cur_flash = flash_addr;

    while (cur_flash < flash_addr + length) {
        // 消去実行
        qspi_transfer(&FLASH_CMD_WREN, NULL);	// Write Enable
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY | FLASH_STATUS_MASK_WEL, FLASH_STATUS_MASK_WEL);
        qspi_transfer(&FLASH_CMD_SE, &(QSPI_TRANSFER_DATA_T){.ar = cur_flash});
        qspi_wait_flash_status(FLASH_STATUS_MASK_BUSY, 0);

        cur_flash += FLASH_SECTOR_SIZE;
    }

    return 0;
}


int qspi_config(const QSPI_TRANSFER_CONFIG_T* config)
{
    DBGLOG0("qspi_config");
    assert(config);

    ER er = E_OK;
    FLGPTN flgptn = 0;
    int spi_error = 0;

    assert(drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 5, 0x1) == 0);

    // ステータスレジスタクリア
    drvcmn_setreg32(QSPI_R_BASE + 0x0C /* QUADSPI_FCR */, 0, (0x1 << 1) | (0x1 << 0), ~(uint32_t) 0);    // CTCF,CTEF

    // イベントフラグクリア
//    er = clr_flg(FLG_DRVFLX, ~FLGPTN_QSPI_TRANSFER_COMPLETE);
//    assert(er == E_OK);

    // 割込み有効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 16) | (0x1 << 17), ~(uint32_t) 0);    // TCIE, TEIE

