TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/asp/bootloader/drvqflx.c
    // QUADSPI_CCR
    uint32_t ccr_val = 0;
    ccr_val = drvcmn_getreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t) 0);   // QUADSPI_CCR
    drvcmn_setreg32((intptr_t) &ccr_val, 26, 0x3, config->fmode);        // FMODE
    drvcmn_setreg32((intptr_t) &ccr_val, 24, 0x3, config->dmode);        // DMODE
    drvcmn_setreg32((intptr_t) &ccr_val, 18, 0x1f, config->dcyc);        // DCYC
    drvcmn_setreg32((intptr_t) &ccr_val, 16, 0x3, config->absize);       // ABSIZE
    drvcmn_setreg32((intptr_t) &ccr_val, 14, 0x3, config->abmode);       // ABMODE
    drvcmn_setreg32((intptr_t) &ccr_val, 12, 0x3, config->adsize);       // ADSIZE
    drvcmn_setreg32((intptr_t) &ccr_val, 10, 0x3, config->admode);       // ADMODE
    drvcmn_setreg32((intptr_t) &ccr_val, 8, 0x3, config->imode);         // IMODE
    drvcmn_setreg32((intptr_t) &ccr_val, 0, 0xff, config->instruction);  // INSTRUCTION

    DBGLOG2("CCR %08x, FMODE %02x", ccr_val, config->fmode);
    drvcmn_setreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t) 0, ccr_val);    // set


//    er = twai_flg(FLG_DRVFLX, FLGPTN_QSPI_TRANSFER_COMPLETE, TWF_ANDW, &flgptn, 3000);
//    assert(er == E_OK);

    // 割込み無効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 16) | (0x1 << 17), 0);   // TCIE, TEIE

    return 0;
}

/*
 * QSPIの転送開始
 */
int qspi_transfer(const QSPI_TRANSFER_CONFIG_T* config, const QSPI_TRANSFER_DATA_T* data)
{
    assert(config);

    ER er = E_OK;
    FLGPTN flgptn = 0;
    int spi_error = 0;

    assert(drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 5, 0x1) == 0);

    // データ転送がある場合
    if (config->dmode != DMODE_NO_DATA) {
        // QUADSPI_DLR
        assert(data);
        assert(data->length > 0);
        drvcmn_setreg32(QSPI_R_BASE + 0x10 /* QUADSPI_DLR */, 0, ~(uint32_t)0, data->length - 1);	// QUADSPI_DLR
    }

    // ステータスレジスタクリア
    drvcmn_setreg32(QSPI_R_BASE + 0x0C /* QUADSPI_FCR */, 0, (0x1 << 1) | (0x1 << 0), ~(uint32_t)0);	// CTCF,CTEF

    // イベントフラグクリア
//    er = clr_flg(FLG_DRVFLX, ~FLGPTN_QSPI_TRANSFER_COMPLETE);
//    assert(er == E_OK);

    // 割込み有効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 16) | (0x1 << 17), ~(uint32_t)0);	// TCIE, TEIE

    // QUADSPI_CCR
    uint32_t ccr_val = 0;
    ccr_val = drvcmn_getreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t)0);	// QUADSPI_CCR
    drvcmn_setreg32((intptr_t)&ccr_val, 26, 0x3, config->fmode);		// FMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 24, 0x3, config->dmode);		// DMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 18, 0x1f, config->dcyc);		// DCYC
    drvcmn_setreg32((intptr_t)&ccr_val, 16, 0x3, config->absize);		// ABSIZE
    drvcmn_setreg32((intptr_t)&ccr_val, 14, 0x3, config->abmode);		// ABMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 12, 0x3, config->adsize);		// ADSIZE
    drvcmn_setreg32((intptr_t)&ccr_val, 10, 0x3, config->admode);		// ADMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 8, 0x3, config->imode);			// IMODE
    drvcmn_setreg32((intptr_t)&ccr_val, 0, 0xff, config->instruction);	// INSTRUCTION
    drvcmn_setreg32(QSPI_R_BASE + 0x14 /* QUADSPI_CCR */, 0, ~(uint32_t)0, ccr_val);	// set

    // アドレスがある場合
    if (config->admode != ADMODE_NO_ADDRESS) {
        assert(data);
        assert(data->ar < FLASH_SIZE);
        drvcmn_setreg32(QSPI_R_BASE + 0x18 /* QUADSPI_AR */, 0, ~(uint32_t)0, data->ar);
    }

    // Alternate bytes がある場合
    if (config->abmode != ABMODE_NO_ALTERNATE_BYTES) {
        assert(data);
        drvcmn_setreg32(QSPI_R_BASE + 0x1C /* QUADSPI_ABR */, 0, ~(uint32_t)0, data->abr);
    }

    // データ転送がある場合
    if (config->dmode != DMODE_NO_DATA) {
        assert(data);
        assert(data->length > 0);

        // フラグクリア
//        er = clr_flg(FLG_DRVFLX, ~FLGPTN_DMA_COMPLETE);
//        assert(er == E_OK);

        if (config->fmode == FMODE_INDIRECT_READ) {
            uint32_t* tmp;
            uint32_t* end;
            tmp = data->mcuaddr;
            end = data->mcuaddr + data->length;
            while (tmp < end) {
                *tmp++ = drvcmn_getreg32(QSPI_R_BASE + 0x20 /* QUADSPI_DR */, 0, ~(uint32_t) 0);
            }
        } else if (config->fmode == FMODE_INDIRECT_WRITE) {
            uint32_t* tmp;
            uint32_t* end;
            tmp = data->mcuaddr;
            end = data->mcuaddr + data->length;

            while (tmp < end) {
                drvcmn_setreg32(QSPI_R_BASE + 0x20 /* QUADSPI_DR */, 0, ~(uint32_t) 0, *(uint32_t*) tmp);
                tmp++;
            }
        } else {
            assert(false);
        }
    }

    // 割込み無効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 0, (0x1 << 16) | (0x1 << 17), 0);	// TCIE, TEIE

    // QSPI DMA無効
    drvcmn_setreg32(QSPI_R_BASE + 0x0 /* QUADSPI_CR */, 2, 0x1, 0);	// DMAEN => 0

    return 0;
}

// DMAコールバック
void dma_isr_callback()
{
    //DBGLOG0("drvcam_dma_isr_callback");

    ER er = iset_flg(FLG_DRVFLX, FLGPTN_DMA_COMPLETE);
    assert(er == E_OK);
}


// フラッシュのステータスポーリング
void qspi_wait_flash_status(uint32_t mask, uint32_t match)
{
    uint32_t sr = 1;

    while (sr != 0) {
        sr = drvcmn_getreg32(QSPI_R_BASE + 0x8 /* QUADSPI_SR */, 5, 0x1);
    }
    return;
}

void qspi_memmap()
{
    qspi_config(&FLASH_CMD_MAP);
}
